constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    in
    {
        type            patch;
        nFaces          600;
        startFace       130650;
    }
    sideWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3000;
        startFace       131250;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2250;
        startFace       134250;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2250;
        startFace       136500;
    }
    out
    {
        type            patch;
        nFaces          600;
        startFace       138750;
    }
)

// ************************************************************************* //
