system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//windTunnel71 --> reduced lenght 

////////////////////////////////////////////////////////////////////////////////////////

convertToMeters 1;

vertices
(
	(0 0 0) //0
	(7.5 0 0) //1
	(7.5 3 0) //2
	(0 3 0) //3

	(0 0 2) //4
	(7.5 0 2) //5
	(7.5 3 2) //6
	(0 3 2) //7
);

////////////////////////////////////////////////////////////////////////////////////////

blocks
(
	//hex (0 1 2 3 4 5 6 7) (750 300 200) simpleGrading (1 1 1) // 1 cm 
	hex (0 1 2 3 4 5 6 7) (75 30 20) simpleGrading (1 1 1) // 10 cm --> test only
);

edges
(
);

boundary
(
	in //0
	{
		type patch;
		faces
		(
		(0 3 4 7)
		);
	}
	sideWall //1
	{
		type wall;
		faces
		(
		(0 1 5 4)
		(3 7 6 2)
		);
	}
	bottomWall //2
	{
		type wall;
		faces
		(
		(3 2 1 0)
		);
	}
	upperWall //3
	{
		type wall;
		faces
		(
		(4 5 6 7)
		);
	}
	out //5
	{
		type patch;
		faces
		(
		(1 2 6 5)
		);
	}
);

mergePairs
(
);

// ************************************************************************* //
